<template>
  <div class="box">
    <div class="content">

      <div class="box">
        <h1>Добро пожаловать на страницу проекта системы "STAFF-APP"!</h1>

        <h2>Автор проекта: Григорьев Алексей</h2>
      </div>


      <div class="box">
        <h2>Описание проекта </h2>
        <p>
          Данный проект является демонстрационной версией использующейся в работе организации системы для автоматизации
          задач в сфере кадровой политики.
          Данная система находится у администраторов организации, у которой существуют дочерние организации в подчинении.
        </p>

        <p>
          "STAFF-APP" является вспомогательной системой, то есть использует данные из внешней БД системы,
          специализирующейся на ведении электронного кадрового документооборота в сфере кадровой политики.
        </p>

        <p>
          В проекте представлены несколько разделов:
        <ol>
          <li>Динамика</li>
          <li>KPI</li>
          <li>Бот Дня Рождения</li>
          <li>Телефонный справочник</li>
          <li>Статистика по окладам</li>
          <li>Минтруд</li>
        </ol>

        </p>
      </div>

      <div class="box">
        <h2> Описание разделов </h2> 

        <div class="card">
          



          <div class="box item">
            <h2> Динамика </h2>

            <h3> Задача </h3>
            <p>
              Формирование графиков, демонстрирующих развитие различных показателей кадровой статистики
              с течением времени.
              Например - средний возраст, кол-во сотрудников, кол-во уволенных и другие статистические показатели
            </p>
            <h3> Описание работы </h3>

            <p>
              С заданной периодичностью на сервере происходит загрузка исходных данных о сотрудниках из внешней базы
              данных
              в
              автоматизированном режиме по API запросу.
              После загрузки приложение производит агрегацию основных показателей с целью увеличения скорости построения
              графиков, при изменении настроек отображения графиков.
              Это реализованно с помощью "Кэш" таблиц, которые хранят вычисленные после загрузки информации данные.
            </p>

          </div>

          <div class="box item">
            <h2> KPI </h2>
            <h3> Задача </h3>
            <p>
              Учет выполнения задач направленых для исполнения в организации.
            </p>

            <h3> Описание работы </h3>

            <p>
              В разделе реализован функционал для создания задач за определенный квартал/год; Формирования отчета о
              выполнении
              в
              формате excel; Изменения статуса выполнения задачи
            </p>
          </div>


          <div class="box item ">
            <h2> График отпусков </h2>

            <h3> Задача </h3>
            <p>
              Вычисление и отображение информации об отпусках сотрудников.
            </p>

            <h3> Описание работы </h3>

            <p>
              С помощью запросов к внешней БД приложение получает необходимые данные и вычисляет необходимые показатели,
              формируя таблицу.
              Также присутсвует возможность выгрузки отчета в формате excel
            </p>
          </div>

          <div class="box item">
            <h2> Бот Дня Рождения </h2>

            <h3> Задача </h3>
            <p>
              Выбор определенных сотрудников для занесения их в список тех, кому необходлимо присылать поздравительную
              открытку.
              Данная инфомрация уже будет использована для работы бота, например в телеграмме.
            </p>

            <h3> Описание работы </h3>

            <p>
              В рабочей версии системы данные о сотрудниках беруться из внешней БД. В данном случае информация о них
              находится
              в
              БД системы "STAFF-APP".
              В разделе можно заносить в таблицу выбранных сотрудников, удалять их из списка и производить редактирования
              информации о сотрудниках.
            </p>
          </div>

          <div class="box item">
            <h2> Телефонный справочник </h2>

            <h3> Задача </h3>
            <p>
              Отображение списка сотрудников, реализация поиска по фио и номеру телефона, предоставлять подробную
              контактную
              инфомрацию о найденном сотруднике.
            </p>

            <h3> Описание работы </h3>

            <p>
              В разделе существует таблица с списокм всех сотрудников, полями для поиска и кнопками для оборажения
              подробной
              инфомрации для выбранного сотрудника
            </p>
          </div>

          <div class="box item">
            <h2> Минтруд </h2>

            <h3> Задача </h3>
            <p>
              Данный раздел необходим для автоматизации сбора данных от организаций для формирования отчетной формы для
              Минтруда.
            </p>

            <h3> Описание работы </h3>

            <p>
              В разделе существует возможность выбора организации для вывода таблицы и дальнейшего заполнения необходимых
              данных.
            </p>
          </div>
          <div class="box item">
            <h2> Статистика по окладам </h2>

            <h3> Задача </h3>
            <p>
              Используя информацию о заработной плате сотрудников в внешней БД сформировать таблицу с итоговой отчетностью
              по
              ряду показателей для каждой организации.
              Также реализовать проверку полноты заполнения полей, необходимых для вычисления.

            </p>

            <h3> Описание работы </h3>

            <p>
              В разделе отображается таблица с необходимой вычисленной на сервере информацией. Также обображается таблица
              с
              полнойтой заполнения полей каждой организацией.
            </p>
          </div>

        </div>
      </div>

    </div>
  </div>
</template>

<script>
import K from "@/lib";

export default {
  data() {
    return {
      data: [],
      stickyHeaders: true,
      selected: {},
      usersCount: 0,
      loading: false,
      loadingRoutes: false,
    };
  },
  methods: {
  }

};
</script>


<style scoped>
.card {
  display: flex;
  flex-direction: row;
  flex-wrap: wrap;
  align-items: stretch;
  box-shadow:none;
}

.item {
  width: 400px;
  margin-right: 30px;
}</style>